using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _1_зад
{
    class Program
    {
        static void Main(string[] args)
        {
            //преобразуване на числото 2063 в двоична бройна система
            //2063/2=1031 =1
            //1031/2=515  =1
            //515/2=257   =1
            //257/2=128   =1
            //128/2=64    =0
            //64/2=32     =0
            //32/2=16     =0
            //16/2=8      =0
            //8/2=4       =0
            //4/2=2       =0
            //2/2=1       =0
            //1/2=0       =1
            // числото получено в двоична бройна система е 100000001111

            //преобразуване на числото 2063 в осмична бройна система
            //2063/8=257  =7 
            //257/6=32    =1
            //32/8=4      =0
            //4/8=0       =4
            // полученото число в осмична бройна система е 4017

            //преобразуване на 2063 в 16-чна бройна система
            //2063/16=128  =15
            //128/16=8     =0
            //8/16=0       =8
            // полученото число е 80F

        }
    }
}
